{
  "format": "layers-model",
  "generatedBy": "keras v3.5.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_1",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                9
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_1"
            },
            "name": "input_layer_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "input_dim": 253,
              "output_dim": 10,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            },
            "name": "embedding_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        9
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "input_layer_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 10,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "OrthogonalInitializer",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        9,
                        10
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "embedding_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "training": false,
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last"
            },
            "name": "flatten_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        9,
                        10
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "lstm_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 50,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        90
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "flatten_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          }
        ],
        "input_layers": [
          [
            "input_layer_1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_1",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            90,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_1/embeddings",
          "shape": [
            253,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/kernel",
          "shape": [
            10,
            40
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            10,
            40
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/bias",
          "shape": [
            40
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}